app/controllers/home_controller.rb

  def search

    if params[:search_terms].blank? || (params[:search_terms][:search_topic].blank? && params[:search_terms][:search_sub_topic].blank?)
      @search = ThinkingSphinx.search params[:search_term], :per_page => 10, :page => params[:page]
      if @search.blank?
        @empty_search = "abc"
      end
      if params[:search_term] == 'Enter a Keyword'
       @search = ThinkingSphinx.search :per_page => 10, :page => params[:page]
      end
    else
      search_terms = refactor_search_terms(params[:search_terms])
      @sub_topics_search = SubTopic.perform_search(params[:search_term], search_terms) unless params[:search_terms][:search_sub_topic].blank? && params[:search_term].blank?
      unless params[:search_terms][:search_sub_topic].blank? && params[:search_term].blank? && @sub_topics_search.blank?
      @empty_search = "abc"
      end
        @questions_search = Question.search params[:search_term]
        subtopic_questions = Question.find(:all ,:conditions=>["sub_topic_id =?", params[:search_terms][:search_sub_topic]])
---
SELECT * FROM `sub_topics`
SELECT * FROM `topics`
SELECT * FROM `questions` WHERE (`questions`.`id` IN (20))
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` IN (8))
SELECT * FROM `topics` WHERE (`topics`.`id` IN (10,9))