app/controllers/questions_controller.rb

SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
SELECT * FROM `questions` WHERE (`questions`.sub_topic_id = 1)
---
  def index
    if (!params[:topic_id].blank?) && (!params[:sub_topic_id].blank?)
      @sub_topic = SubTopic.find params[:sub_topic_id]
      @questions = @sub_topic.questions unless @sub_topic.blank?

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 7)
SELECT * FROM `topics` WHERE (`topics`.`id` = 9)
---
  def show
    unless params[:id].blank?
      @question = Question.find(params[:id])
    end
    if (!params[:topic_name_slug].blank? && !params[:sub_topic_name_slug].blank? && !params[:question_slug].blank?)
      id = params[:question_slug].split("-").last
      @question = Question.find(id)
    end
    # return head(404) unless @question
    #unless @question.verse_ids.blank?
      #verse_ids = @question.verse_ids.split(",")
      @verses = Hash.new
      @question.references.each do |reference|
       @verses[reference.id.to_s] = Verse.find_by_aya_and_sura(reference.from.split(":").last, reference.from.split(":").first)
      end
    #end
     @related_subject = SubTopic.find(:all,:limit => 5, :conditions => ['id NOT IN(?) AND topic_id = ?',@question.sub_topic,@question.sub_topic.topic_id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO `questions` (`created_at`, `updated_at`, `verse_ids`, `quest`, `tags`, `sub_topic_id`, `answer`) VALUES('2012-02-09 15:07:25', '2012-02-09 15:07:25', NULL, 'Who Is Our Creator', '', 8, 'Allah')
---
  def create
    @question = Question.new(params[:question])
    set_author_and_last_updated_by(@question)

    respond_to do |format|
      if @question.save

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
UPDATE `questions` SET `tags` = '1:2,2:5,5:1', `updated_at` = '2012-02-08 12:12:50', `verse_ids` = '2,12,670' WHERE `id` = 3
---
  def update
    @question = Question.find(params[:id])
    respond_to do |format|
      if @question.update_attributes(params[:question])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
DELETE FROM `questions` WHERE `id` = 1
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy