app/controllers/sub_topics_controller.rb

  def index
    unless params[:topic_id].blank?
      @topic = Topic.find params[:topic_id]
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.topic_id = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)

  def show
    unless (params[:id].blank?)
      @sub_topic = SubTopic.find(params[:id])
    end
    if (!params[:topic_name_slug].blank? && !params[:sub_topic_name_slug].blank?)
      topic = Topic.find_by_name_slug(params[:topic_name_slug])
      return head(404) unless topic
      @sub_topic = SubTopic.find_by_name_slug_and_topic_id(params[:sub_topic_name_slug],topic.id)
    end
      @popular_questions = @sub_topic.questions.find(:all,:limit => 5,:order => 'view_count DESC')
      @latest_questions = @sub_topic.questions.find(:all,:limit => 5,:order => 'created_at DESC')
      @related_subject = SubTopic.find(:all,:limit => 5, :conditions => ['id NOT IN(?) AND topic_id = ?',@sub_topic,@sub_topic.topic_id])
      @sub_topic_questions = @sub_topic.questions.all
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`topic_id` = 9 AND `sub_topics`.`name_slug` = 'sub-Topic') LIMIT 1
SELECT * FROM `topics` WHERE (`topics`.`name_slug` = 'Allah-Our-Creator') LIMIT 1
SELECT * FROM `questions` WHERE (`questions`.sub_topic_id = 8)
SELECT * FROM `sub_topics`
SELECT * FROM `topics`

  def edit
    @sub_topic = SubTopic.find(params[:id])
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)

  def create
    @sub_topic = SubTopic.new(params[:sub_topic])

    respond_to do |format|
      if @sub_topic.save
---
INSERT INTO `sub_topics` (`name`, `name_slug`, `created_at`, `updated_at`, `description`, `topic_id`) VALUES('sub Topic', NULL, '2012-02-06 13:51:50', '2012-02-06 13:51:50', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 1)

  def update
    @sub_topic = SubTopic.find(params[:id])

    if params.include?("photo_name")
      @sub_topic.photo.destroy
      @sub_topic.save
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 4)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
UPDATE `sub_topics` SET `updated_at` = '2012-02-06 14:47:30', `name` = 'sub Topic edited' WHERE `id` = 4

  def destroy
    @sub_topic = SubTopic.find(params[:id])
    @sub_topic.destroy
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.`id` = 5)
SELECT * FROM `topics` WHERE (`topics`.`id` = 2)
DELETE FROM `sub_topics` WHERE `id` = 5