app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT * FROM `sub_topics`
SELECT * FROM `topics`

  def show
    unless (params[:id].blank?)
      @topic = Topic.find(params[:id])
    end
    unless (params[:topic_name_slug].blank?)
      @topic = Topic.find_by_name_slug(params[:topic_name_slug])
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.topic_id = 9)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`name_slug` = '9') LIMIT 1

  def edit
    @topic = Topic.find(params[:id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 8)

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`name`, `name_slug`, `meaning`, `created_at`, `updated_at`, `description`) VALUES('Allah (Our Creator)', NULL, 'God is He, Beside Whom there is no other god;- Who knows (all things) both secret and open; He, Most Gracious, Most Merciful.', '2012-02-09 11:34:48', '2012-02-09 11:34:48', 'First of all, it is important to note that \"Allah\" is the same word that Arabic-speaking Christians and Jews use for God. If you pick up an Arabic Bible, you will see the word \"Allah\" being used where \"God\" is used in English. This is because \"Allah\" is the only word in the Arabic language equivalent to the English word \"God\" with a capital \"G\". Additionally, the word \"Allah\" cannot be made plural or given gender (i.e. masculine or feminine), which goes hand-in-hand with the Islamic concept of God. Because of this, and also because the Qur\'an, which is the holy scripture of Muslims, was revealed in the Arabic language, some Muslims use the word \"Allah\" for \"God\", even when they are speaking other languages. This is not unique to the word \"Allah\", since many Muslims tend to use Arabic words when discussing Islamic issues, regardless of the language that they speak. This is because the universal teachings of Islam - even though they have been translated in every major language - have been preserved in the Arabic language. ')

  def update
    @topic = Topic.find(params[:id])

    if params.include?("photo_name")
      @topic.photo = nil
      return render :text => "success"
    end
    respond_to do |format|
      if @topic.update_attributes(params[:topic])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
UPDATE `topics` SET `updated_at` = '2012-02-07 07:18:52', `description` = 'Allah is the name of the true One God in the Arabic language. In the Hebrew language His name is Eloh, Elohim for respect. It is well known that when a word is borrowed from one language to another, its spelling and pronunciation is often altered. It is, therefore, reasonable to say that Eloh and Allah are names of the same Deity of Abraham believed by the three monotheistic religions of Judaism, Christianity and Islam. Islam is the most rigorously monotheistic religion among the three dedicated to the worship of Allah, never seen by a human eye.\r\nAllah is the name of the true One God in the Arabic language. In the Hebrew language His name is Eloh, Elohim for respect. It is well known that when a word is borrowed from one language to another, its spelling and pronunciation is often altered. It is, therefore, reasonable to say that Eloh and Allah are names of the same Deity of Abraham believed by the three monotheistic religions of Judaism, Christianity and Islam. Islam is the most rigorously monotheistic religion among the three dedicated to the worship of Allah, never seen by a human eye.' WHERE `id` = 1

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT * FROM `sub_topics` WHERE (`sub_topics`.topic_id = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
DELETE FROM `sub_topics` WHERE `id` = 1
DELETE FROM `topics` WHERE `id` = 1