app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '3d73fdf0b257cbf21f598f78c5ed374f57b30b8f', '2012-02-02 09:10:25', 'f323968087d252662ae37138db5ce2f49c2117e5', NULL, '2012-02-02 09:10:25', NULL, 'admin', 'admin@test.com')
---
  def create

    @user = User.new(params[:user])
    success = @user && @user.save