app/controllers/verse_controller.rb

SELECT * FROM `languages`
---
  def show
    @verse = Verse.find_by_id(params[:id]) if (!params[:id].blank?)
    return head(404) unless @verse
    unless params[:language].blank?